# Live Project:


### Eyeballing information:

###### 1.) File format is excel
###### 2.) There are 5 sheets: Analysis Summary, Expenses details, Inward Cash Flow. Bank Account Reconsilition, Details
###### 3.) Details tells the categorisation of Expence type and Exp Source
###### 4.) There are multiple unnecessary blank spaces
###### 5.) Expence Detials is based on only counter book (ONLY)
###### 6.) The range of Expence data is from 1st Jan 2023 to 21st July 2023
###### 7.) Difference in Total Expence(24,20,492) and  Cash Inflow(64,79,004) is 40,58,512


### What to do:

###### 1.)Using pandas is recommended for data cleaning
###### 2.)Check for missing values or missing data
###### 3.)Removal of unncessary column is advised
###### 4.)Removal of seperation rows in advised

### Observation:

###### 1.) No Beverage sold in the given time, 
###### 2.) Salary and Petrol are the most repeated tasks(Automation of salary calculation should be done on basis of attendance)
###### 3.) For Feb. and Mar. their was no payment of Chicken
###### 4.) Payment for Mutton and Fish was done only once in the complete 7 month time span

In [1]:
import pandas as pd #imported pandas
import numpy as np #imported numpy
np.set_printoptions(suppress = True,
                   linewidth = 100,
                   precision = 2)

In [2]:
expense_details = pd.read_excel("Sales Summary.xlsx", sheet_name="Expenses details")

In [3]:
expense_details

           Date Month         Expense Details  Amount   Catagory    Exp Source
0    2023-01-01   Jan             HPGas big 1  1950.0     02_Gas  Counter Book
1    2023-01-01   Jan            Live singing  5000.0    03_Misc  Counter Book
2    2023-01-01   Jan  Suraj waiter (Adv Dec)  2000.0  04_Salary  Counter Book
3    2023-01-01   Jan  Ganesh Kumre (Adv Dec)   500.0  04_Salary  Counter Book
4    2023-01-01   Jan        Yogesh (Adv Dec)  1000.0  04_Salary  Counter Book
...         ...   ...                     ...     ...        ...           ...
1122 2023-07-20  July    Yuvraj full sal June  6500.0  04_Salary  Counter Book
1123        NaT   NaN                     NaN     NaN        NaN           NaN
1124 2023-07-21  July            French fries   380.0   01_Dairy  Counter Book
1125 2023-07-21  July                  Corn 2   240.0   01_Dairy  Counter Book
1126 2023-07-21  July    Pankaj full sal June  7800.0  04_Salary  Counter Book

[1127 rows x 6 columns]

In [4]:
expense_details = expense_details.dropna(how='all')
#removed unnecessary blank rows

In [5]:
expense_details

           Date Month         Expense Details  Amount   Catagory    Exp Source
0    2023-01-01   Jan             HPGas big 1  1950.0     02_Gas  Counter Book
1    2023-01-01   Jan            Live singing  5000.0    03_Misc  Counter Book
2    2023-01-01   Jan  Suraj waiter (Adv Dec)  2000.0  04_Salary  Counter Book
3    2023-01-01   Jan  Ganesh Kumre (Adv Dec)   500.0  04_Salary  Counter Book
4    2023-01-01   Jan        Yogesh (Adv Dec)  1000.0  04_Salary  Counter Book
...         ...   ...                     ...     ...        ...           ...
1121 2023-07-20  July          Ankit July adv  1000.0  04_Salary  Counter Book
1122 2023-07-20  July    Yuvraj full sal June  6500.0  04_Salary  Counter Book
1124 2023-07-21  July            French fries   380.0   01_Dairy  Counter Book
1125 2023-07-21  July                  Corn 2   240.0   01_Dairy  Counter Book
1126 2023-07-21  July    Pankaj full sal June  7800.0  04_Salary  Counter Book

[946 rows x 6 columns]

In [6]:
expense_details.to_excel("Expense-Details.xlsx", index = False)
#created a back-up

In [7]:
expense_details.drop("Month",axis=1,inplace=True)
#No need of months column the dates show the month

C:\Users\DELL\AppData\Local\Temp\ipykernel_16088\1269580459.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expense_details.drop("Month",axis=1,inplace=True)

In [8]:
expense_details

           Date         Expense Details  Amount   Catagory    Exp Source
0    2023-01-01             HPGas big 1  1950.0     02_Gas  Counter Book
1    2023-01-01            Live singing  5000.0    03_Misc  Counter Book
2    2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary  Counter Book
3    2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary  Counter Book
4    2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary  Counter Book
...         ...                     ...     ...        ...           ...
1121 2023-07-20          Ankit July adv  1000.0  04_Salary  Counter Book
1122 2023-07-20    Yuvraj full sal June  6500.0  04_Salary  Counter Book
1124 2023-07-21            French fries   380.0   01_Dairy  Counter Book
1125 2023-07-21                  Corn 2   240.0   01_Dairy  Counter Book
1126 2023-07-21    Pankaj full sal June  7800.0  04_Salary  Counter Book

[946 rows x 5 columns]

In [9]:
expense_details["Exp Source"].unique()
#checking if there is any other source of expences

array(['Counter Book'], dtype=object)

In [10]:
expense_details.drop("Exp Source", axis=1, inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_16088\2498295097.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expense_details.drop("Exp Source", axis=1, inplace=True)

In [11]:
expense_details

           Date         Expense Details  Amount   Catagory
0    2023-01-01             HPGas big 1  1950.0     02_Gas
1    2023-01-01            Live singing  5000.0    03_Misc
2    2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary
3    2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary
4    2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary
...         ...                     ...     ...        ...
1121 2023-07-20          Ankit July adv  1000.0  04_Salary
1122 2023-07-20    Yuvraj full sal June  6500.0  04_Salary
1124 2023-07-21            French fries   380.0   01_Dairy
1125 2023-07-21                  Corn 2   240.0   01_Dairy
1126 2023-07-21    Pankaj full sal June  7800.0  04_Salary

[946 rows x 4 columns]

In [12]:
expense_details["Catagory"].unique()

array(['02_Gas', '03_Misc', '04_Salary', '04_Samaj seva', '03_Petrol', '01_Kirana',
       '02_Electric bill', '04_ODC', '03_Cash Return', '01_Dairy', '03_Room Rent', '01_Vegetables',
       '01_Non Veg', '04_Salary OT', '03_Maintainance', '01_Egg', '02_Coal', '01_Mutton',
       '01_Chicken', '01_Fish'], dtype=object)

In [13]:
len(expense_details["Catagory"].unique())
#So there are in total 20 unique places where the money has been used

20

In [14]:
expense_details["Catagory"].value_counts()

Catagory
04_Salary           417
03_Petrol           118
02_Gas               92
03_Misc              84
03_Maintainance      35
01_Kirana            32
04_Samaj seva        29
03_Cash Return       28
04_ODC               24
01_Dairy             18
01_Vegetables        17
04_Salary OT         15
03_Room Rent         11
02_Electric bill      9
02_Coal               6
01_Non Veg            3
01_Egg                3
01_Chicken            3
01_Mutton             1
01_Fish               1
Name: count, dtype: int64

In [15]:
expense_details["Expense Details"].unique()
#this given the various unique values or in simple words where the money was spent

array(['HPGas big 1', 'Live singing', 'Suraj waiter (Adv Dec)', 'Ganesh Kumre (Adv Dec)',
       'Yogesh (Adv Dec)', 'Ankit chef (Adv Dec)', 'Rakesh waiter (Full salary Nov)',
       'Rakesh waiter (Adv Dec)', 'Ashok vat electricity balance', 'Samaj seva ', 'Omni Petrol',
       'Hp Gas small2', 'Tea', 'Tija bai (Adv Dec)', 'Vinod chef (Adv Dec)',
       'Kapil Chef (Adv Dec)', 'Dilip kaka (Adv Dec)', 'Omni petrol', 'Aniket Chef (Adv Dec)',
       'Wheel powder', 'Samaj seva', 'HP Gas small 2', 'Ajay (Adv Dec)',
       'Boys room electricity bill', 'Girls room rent (November month)',
       'Sunita bai divakar (Adv Dec)', 'HP Gas small 1', 'Bonfire Lakdi', 'Ajay sir (Adv Dec)',
       'HP Gas big 1', 'Golu ODC', 'Corn flour', 'Dhiraj verma (Adv Dec)',
       'Pooja waiter (Adv Dec)', 'Mona waiter (Adv Dec)', 'Party decoration', 'Cash return',
       'Bike petrol', 'Kapil chef (Adv Dec)', 'Ankit (Adv Dec)', 'Bonfire lakdi',
       'Vinod Chef (Adv Dec)', 'Sugar', 'Hp gas small 1', 'Bike petrol (Arvind)',
       'Sarswati bai ( Dec full salary)', 'Sumitra bai ( Dec full salary)', 'Suraj (Adv Dec)',
       'Hp gas Big 1', 'HP gas small 1', 'Egg tray', 'Deepak chef (Full salary Dec)',
       'Mona (Full salary Dec)', 'Liquor', 'Arvind (Adv January)', 'Ankit chef (Adv December)',
       'Bike Petrol', 'Yuvraj chef (Adv Dec)', 'Korde kaka (Full salary Dec)', 'Hemant (Adv Dec)',
       'Tija bai (Full dec salary)', 'Kapil chef (full dec salary)', 'Radheshyam full bandor',
       'Suraj (Adv Dec) ', 'Boys room rent december', 'Boys room rent new adv for January',
       'Sheetal aqua part payment 10/22 to 31/22', 'Dilip kaka (Dec full salary)',
       'Vinod chef (Dec full salary)', 'Vinod chef (Jan Adv)', 'Dhiraj waiter (Dec adv)',
       'Vishal (Dec full salary)', 'Dhiraj Verma (Dec full salary)', 'Live singing old balance',
       'Rakesh waiter (December full salary)', 'Sheetal aqua full payment 10/22- 31/22',
       'Pooja (Dec adv)', 'Vinegar', 'Rupesh chef (Dec Adv)',
       'Raju Ram kaka (November full salary)', 'Ankit chef (Dec Adv)', 'Cigrette', 'Gulab Jamun',
       'Samaj Seva', 'Rakesh waiter (Jan adv)', 'Suraj waiter (Dec full salary)', 'M4 cash return',
       'Sunita divakar (Dec. Full Salary)', 'Dhiraj Mashram (Dec Adv)', 'Girls room rent new',
       'Yuvraj Chef (Dec full salary)', 'Hara Dhaniya 3 kg', 'G3 Cash return',
       'Pooja (Dec full salary)', 'Jeetu cleaner (old bal)', 'Jeetu (Dec Full salary)',
       'Ankit counter (Dec full salary)', 'Hari mirchi', 'Vinod chef (Jan adv)',
       'Ankit chef (Dec Full salary)', 'Ajay sir (Dec full salary)',
       'Dhiraj Mashram (Dec full salary)', 'Ganesh Kumre (Dec full salary)', 'Chai patti (2 pkt)',
       'Bread ', 'Paneer 2kg', 'Rupesh chef OT (26/1/23)', 'Agarbati (1 pkt)',
       'Sumitra Bai (Jan adv)', 'Korde kaka (Jan adv)', 'Sunita bai (Jan adv)',
       'Tija bai (Jan adv)', 'Arvind waiter (Jan adv)', 'Hara dhaniya', 'Vinod Chef (Jan adv)',
       'Kapil chef (Jan adv)', 'Saraswati Bai (Jan adv)', 'Chicken (1 khoka)',
       'Dhiraj verma (Jan adv)', 'M2 cash return', 'Ankit chef (Jan adv)', 'Teeja bai (Jan adv)',
       'Beverage', 'Egg tray 2', 'Ajay sir (Jan adv)', 'Mona (Jan adv)', 'Ajit (Jan adv)',
       'Rajaram kaka (2/2/23) OT', 'Ankit Counter (Jan adv)', 'M3 cash return',
       'Dilip kaka (Jan adv)', 'Suraj waiter (Jan adv)', 'Hemant sir (Dec Full salary)',
       'M1 Cash return', 'Beverages', 'Rajaram kaka (Full salary)', 'Dhiraj Meshram (Jan adv)',
       'Mixie repairing', 'Yuvraj chef (Jan adv)', 'JCB', 'Sajid fridge repairing', 'Noodles',
       'PTM (New)', 'Deepak Chef (Jan adv)', 'Cifron payment', 'HP Gas small', 'Bonfire (lakdi)',
       'Pooja (Jan adv)', 'Rajaram Kaka (OT)', 'Ankit counter (Jan adv)', 'HP Gas Big',
       'Mona (Jan full salary)', 'M5 cash return', 'Jeetu (Jan full salary)',
       'Korde kaka (Jan full Salary)', 'Suraj (Jan full salary)', 'Arvind (Jan adv)',
       'Vinod chef (Jan full salary)', 'Deepak chef (Jan full salary) ', 'Milk (1/2 ltr)',
       'Bread (2Pkt)', 'Arvind (Jan full salary)', 'Tandoor coal payment',
       'HP Gas small 1 & big 1', 'TCP', 'Tomato (2kg)', 'Pooja waiter (Jan full salary)',
       'Kapil chef (Jan full salary)', 'Bus rent', 'Tija bai (Jan full salary)',
       'Sarswati bai (Full salary)', 'Boys room rent jan', 'Dilip kaka (Jan full salary)',
       'Sugar 1 kg', 'Dinesh electrician ', 'Bablu Pest control', 'Yuvraj chef (Jan 3/2/23 OT)',
       'HP Gas Big 1', 'HP Gas small 1 ', 'Sunita bai (Jan full salary)',
       'Sumitra bai (Jan full salary)', 'Bread (11 pkt)', 'Cabbage',
       'Yuvraj chef (Jan full salary)', 'Dhiraj waiter (Jan adv)', 'Vinod chef (OT 14/2/23)',
       'Electricity bill', 'Dahi', 'Oil (3 pkt)', 'Tomato 2.5 kg', 'Cabbage ', 'Cauliflower',
       'Dahi (3 kg)', 'Korde kaka (Feb Adv)', 'Rakesh (Jan full salary)', 'Dhiraj Verma OT (20/2)',
       'Dhiraj Verma (Jan full salary)', 'Rupesh chef (Jan pat salary)', 'Samaj seva (Kinnar)',
       'Vishal (Jan full salary)', 'Rupesh chef (Jan full salary)', 'Sarswati Bai (Jan OT )',
       'Ankit chef (Jan full salary)', 'Ankit chef (Feb adv)', 'Ajay sir (Jan Full salary)',
       'Ajay sir (Feb adv )', 'Electricity repairing', 'Vinod Chef (Feb adv)', 'M1 cash return',
       'Bush color', 'Ajay sir (Feb adv)', 'Girls room rent Jan', 'Kapil chef (Feb adv)',
       'G4 cash return', 'Yuvraj chef (Feb adv)', 'Ganesh (Jan Full salary)',
       'Korde kaka (Feb adv)', 'Dhiraj Meshram (Jan full salary)', 'Arvind (Feb adv)',
       'Suraj (Feb adv)', 'Oriyo sakal', 'Dhiraj Verma (27/2 OT)', 'Rupesh chef (2/3 OT)',
       'Tija bai (Feb adv)', 'Sarswati Bai (Feb adv)', 'Sumitra Bai (Feb adv)', 'Cash return (M4)',
       'Omlal (Feb adv)', 'Sarswati bai (Feb adv)', 'Sumitra Bai (Feb adv) ', 'Dhaniya 2kg',
       'Golu sir ODC', 'Tissue paper old bal', 'Dilip kaka (Feb adv)', 'Rakesh waiter (Feb adv)',
       'Ankit counter salary', 'Samajseva ', 'Ajay kirana ', 'Petrol', 'Gas cylender', 'Oil 2 pkt',
       'Chef OT', 'Vinay ODC + Petrol', 'Ajay (Feb salary adv)', 'HP Gas small ', 'HP Gas big',
       nan, 'Mona (Feb adv)', 'Ankit chef (part salary feb)', 'Vinay (ODC + Petrol)', 'Tomato',
       'Oil', 'Kapil (Feb full salary)', 'Korde kaka(Feb full salary)', 'Korde kaka (March adv)',
       'Bus kiraya', 'Dilip kaka (Part salary)', 'Rupesh chef (Feb full salary)', 'Oil 2pkt',
       'Agarbati', 'Sumitra bai (Feb full salary)', 'Tija bai ( Feb full salary)',
       'Rupesh chef OT ', 'Dhaniya, cabbage', 'Boys room rent feb', 'Suraj (Feb full salary)',
       'Dhiraj Mashram (Full salary)', 'Ajay sir (Feb full salary)', 'Ajay sir (March adv)',
       'Dog chain', 'Ankit ( Feb adv)', 'Sugar 1kg', 'Sumitra bai (March adv)',
       'Teeja kaka (Feb full salary)', 'Suraj waiter (March adv)', 'HP gas big 1', 'Paneer 3.5 kg',
       'Sunita bai (Feb full salary)', 'Kapil (March adv)', 'Beverages part payment',
       'Pankaj chef (March adv)', 'Sheetal aqua payment', 'Sarswati bai (feb part payment)',
       'Ganesh kumre (Feb adv)', 'Hp Gas small 1', 'Dilip kaka (feb part salary)',
       'Girls room rent (Feb)', 'Mutton', 'Sarswati bai (Feb full salary)',
       'Dilip kaka (Feb full salary)', 'Yuvraj chef (March adv)', 'Garden cleaner',
       'broom and agarbatti', 'Disk TV recharge', 'Kartik ODC', 'Ankit chef (March adv)', 'Tape',
       'Arvind (March adv)', 'Suraj (March adv)', 'Sarswati Bai (March adv)', 'HP gas small + big',
       'Mosquito agarbatti', 'Boys room old bal electricity bill', 'Dhiraj verma (March adv)',
       'Ankit (Feb full salary)', 'Two ODC', 'Omlal (Feb full salary)',
       'Boys room electricity bill feb', 'Disk TV cabel repairing ', 'Electrician repairing',
       'Red bull', 'Samaj seva (drinks)', 'Decoration party', 'Oil (5 kg)', 'Petrol bike',
       'HP gas small 1 ', 'Pooja (March adv)', 'Broom', 'Oil 5 kg', 'Cabbage 4 kg', 'Tomato 2 kg',
       'Egg 1 tray', 'Dhiraj Mashram (March adv)', 'Medical bill', 'HP gas small1',
       'Dinesh electrician loan', 'Ankit chef (6/4) OT', 'Ajay (March adv)', 'HP gas small 2',
       'Vishal (March adv)', 'Dhiraj chef (March adv)', 'Yogesh final salary', 'Noodles (2p)',
       'Kamal (March part salary)', 'Rupesh chef (March adv)', 'Tija bai (March adv)',
       'Pooja (March part salary)', 'Komal (March full salary)', 'Ajit (Feb full salary)',
       'Rakesh (March adv)', 'Store key', 'Parcel bags Big', 'Vegetables ',
       'Ajay (March full salary)', 'Ajay (April adv)', 'Korde kaka (March full salary)',
       'Ajay (april adv)', 'Tija bai (Feb OT)', 'Saraswati bai (April adv)',
       'sumitra bai (March full adv)', 'Tarachand kaka (March full salary)',
       'Tarachand kaka (April full salary)', 'Ajay  (April adv)', 'Ankit counter (March adv)',
       'Deepak chef (March full salary)', 'Kapil chef (March full salary)', 'Khada jeera (250 gm)',
       'Pankaj chef (March full salary)', 'Rupesh chef (March full saalry)', 'Ganesh (March adv )',
       'Arvind (March full salary)', 'ankit chef (March adv)', 'Suraj (March full salary)',
       'Egg tray 1', 'bike petrol', 'Cigrette ', 'Sunita bai (March adv)',
       'Pooja (March full saalry)', 'Dhiraj verma (March full salary)',
       'Saraswati bai (April advance)', 'Tija bai (March full salary)',
       'Sunita bai (March full salary)', 'Golu (adv April)', 'Mona (March full salary)',
       'Yuvraj (Sep March adv)', 'Rajaram kaka (March adv)', "Boy's room rent (March)",
       'Gas repairing', 'HP gas small', 'Ajinomoto', 'Cheese (500gm)', 'Rakesh (April adv)',
       'Coal payment', 'Vishal (March full salary)', 'Sumitra bai (April adv)',
       'Ankit chef (March full salary)', 'HP gas big', 'Arvind (April adv)',
       'Ankit counter (March full salary)', 'Suraj April adv', 'Ankit chef May adv',
       'Dhiraj verma May adv', 'Ankit chef April adv', 'Boys room electricity bill (March)',
       'Omni petrol ', 'Amul cream (2 otk)', 'Golu bhaiya Adv', 'Cash return ',
       'Arvind salary adv', 'Kamal April adv. ', 'Bada khoka 2', 'Small + Big chicken (5/5/23)',
       'Golu adv May', 'Kartik April adv.', 'Ajay salary adv', 'Ankit april adv',
       'Kapil april adv', 'Riksha rent', 'Dhiraj chef OT ', 'Deepak chef April adv',
       'Ankit April adv ', 'Dhiraj verma April adv', 'Sarswati April adv',
       'Dhiraj Verma April adv. ', 'Pankaj chef April full salary', 'Tija bai April full salary',
       'Sunita bai April full salary', 'Suraj Dhoke April full salary',
       ' Suraj Dhoke May full salary', 'Tarachand kaka april full salary', 'Dhiraj Verma May adv',
       'Deepak chef April full salary', 'Ankit chef April full salary',
       'Ankit counter April full salary', 'Korde kaka April full salary',
       'Kapil chef April full salary', 'Komal April full salary', 'Swati bai full salary',
       'Aata 2kg, maida 2 kg, powder 1 kg', 'Card part payment', 'Wheel powder 1 kg',
       'Ajay adv salary', 'staff rice 3kg', 'Mona April full salary', 'Boys room rent April',
       'Motor repairing', 'Sheetal aqua part salary', 'Kartik May adv',
       'Sumitra bai April full salary', 'vishal April full salary', 'vrinda bai OT',
       'Yuvraj chef april adv. ', 'Rupesh chef April adv.', 'Rupesh chef April full salary',
       'Card payment', 'Yuvraj chef April full salary', 'Pankaj chef May adv.',
       'Sarswati bai May adv', 'Salt 1 pkt', 'Rakesh waiter April full salary',
       'Sumitra Bai May adv', 'Tarachand kaka May adv', 'Suraj Dhoke May adv',
       'Suraj waiter April full salary', 'Pankaj chef May adv', 'Korde kaka May adv ',
       'Tija bai May adv', 'Misc exp.', 'Sajid Freeze repairing', 'Beverages ',
       'Raja Ram kaka April part salary', 'Arvind waiter (adv May)', 'Drink',
       'Chota suraj (May adv)', 'Dhiraj verma (May adv)', 'Golu bhaiya (May adv)',
       'Vishal (May adv)', 'Rupesh chef (May adv)', 'Torch', 'Sunita bai (May adv)',
       'Suraj waiter (May adv)', 'Riksha Petrol', 'Five big Cylinder', 'Yataj Beverages',
       'Kartik (May Adv)', 'Sarswati Bai (May adv)', 'Golu Bhaiya (May adv)',
       'Sunita Bai (May adv)', 'Boys room April electricity bill', 'Ganesh Kumre April adv',
       'Girls room rent (March + April)', 'Red color 1', 'Besan 1 kg',
       'Ganesh (April full salary)', 'Five big cylinder', 'Yuvraj chef (May adv)', 'Agarbatti 1',
       'Amul cream', 'Red color', 'Deepak chef (May full salary)', 'Yuvraj chef (May full salary)',
       'Ajay (April salary)', 'Golu bhaiya (Full salary)', 'Golu bhaiya (June adv)',
       'Kapil chef (May full salary)', 'Korde kaka (May full salary)', 'Ganesh (May adv)',
       'Electrician', 'Tarachand kaka (May full salary)', 'Tija bai (May full salary)',
       'Dhiraj verma (June adv)', 'Ajay (nail, volt)', 'Sunita bai (May full salary)',
       'Sumitra bai (May full salary)', 'Sarswati bai (May full salary)',
       'Shubham (April full salary)', 'Shubham (May full salary)', 'Rupesh chef (May full salary)',
       'Egg tray , tadka mirchi, tea ', 'Pankaj chef (May full salary)', 'Mona (May full salary)',
       'Vishal (May full salary)', 'Ankit chef (May full salary)',
       'Ankit counter (May full salary)', 'Ankit counter (June adv) ', 'Rakesh ODC', 'Kartik Adv',
       'Arvind (Adv)', 'Ajay ', 'Chota sagooj', 'Shahu Kabadi ', 'Newspaper adv.', 'Achaar bottle',
       'Ashok wath', 'Sprite 2 ltr', 'cabbage', 'Disposable Glass', 'Tooth pick',
       'Cylinder (small + big)', 'Room rent', 'Table cloth & curtain', 'Samajseva', 'Ankit chef',
       'Crusher dust', 'Plumbing carting', 'Plumber adv', 'Fabricate Adv', 'IB chicken',
       'Kapil chef Adv', 'Aluminium partition', 'Inverter battery', 'Onion', 'Fabricator',
       'Suraj adv', 'Kartik adv', 'Milind electrician', 'Pankaj chef', 'Dhiraj ODC', 'Tija bai ',
       'Sumitra Bai', 'Golu adv', 'Electrician ', 'Besan ', 'J Bolt', 'Gas payment 7',
       'Korde Kaka ', 'Suraj Jarbade', 'Chota Suraj', 'Dhiraj Verma adv', 'Shubham adv',
       'Oil 3 pkt', 'Ice cream', 'Ice box', 'Paint', 'Chicken ', 'Pest control', 'Ashok Watt',
       'Deepak Thapa Bus rent', 'Sagar Painter ', 'Suraj salary adv', 'Ankit chef adv',
       'Ceiling fan 4', 'Indian Broiler', 'Emergency chef', 'Kapil ODC', 'Ya Taj Beverages',
       'staff party', 'Vishal salary adv.', 'Ajay May salary', 'Ajay June salary adv', 'Hardware',
       'Tija bai', 'sunita Bai', 'Yuvraj Chef', 'Sarswati Bai', 'Nagpur Hardware', 'Deepak chef',
       'Plumber', 'Kartik salary adv', 'Ashok watt', 'Small gas', 'Golu salary (June)',
       'Ajay salary adv june', 'Dheeraj chef', 'Labour', 'Coal ', 'Beverages ya taj',
       'Ankit chef OT', 'Sagar painter', 'Rao NHAI', 'Fish', 'Green peas', 'Water bottles',
       'Milind Plumber', 'Screw', 'Van tube', 'Milind final ', 'Korde kaka June salary',
       'Tarachand kaka full Jan salary', 'Tija bai full sal June', 'Sunita bai full sal June',
       'India broiler full payment', 'Saraswati bai full sal June', 'Sumitra bai full sal June',
       'Arvind July adv', 'Deepak full sal June', 'Dhiraj June adv.', 'Dhiraj full sal June',
       'Mona full sal June', 'Chota suraj full salary June', 'Suraj Full salary', 'Sajid Fridge',
       'Vishal full sal June ', 'Suraj Bal adv July', 'Yuvraj Sal June', 'Vinay ODC',
       'Gas payment', 'Coal', 'Dhiraj July adv', 'Ankit Full sal', 'Shubham full sal June',
       'Sunny July adv', 'Ankit July adv', 'Yuvraj full sal June', 'French fries', 'Corn 2',
       'Pankaj full sal June'], dtype=object)

In [16]:
len(expense_details["Expense Details"].unique())
#the exact number of unique values or unique reason why money was spent

637

In [17]:
expense_details["Expense Details"].value_counts()
#how many time the given action was repeated

Expense Details
Bike petrol               45
Omni petrol               41
HP Gas small 1            24
HP gas small 1            19
Samaj seva                19
                          ..
Sarswati bai (Feb adv)     1
Omlal (Feb adv)            1
Cash return (M4)           1
Sumitra Bai (Feb adv)      1
Pankaj full sal June       1
Name: count, Length: 636, dtype: int64

In [18]:
expense_details["Expense Details"].value_counts().to_excel("Unique-Expense-Details.xlsx")
#the unique places where the money was spent was saved for further understanding

In [19]:
expense_details.set_index("Date",inplace=True)

In [20]:
expense_details

                   Expense Details  Amount   Catagory
Date
2023-01-01             HPGas big 1  1950.0     02_Gas
2023-01-01            Live singing  5000.0    03_Misc
2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary
2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary
2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary
...                            ...     ...        ...
2023-07-20          Ankit July adv  1000.0  04_Salary
2023-07-20    Yuvraj full sal June  6500.0  04_Salary
2023-07-21            French fries   380.0   01_Dairy
2023-07-21                  Corn 2   240.0   01_Dairy
2023-07-21    Pankaj full sal June  7800.0  04_Salary

[946 rows x 3 columns]

In [21]:
#As from further analysis it is Observed that the non-veg was nothing but Chicken so we are replacing the same
replace_nonVeg = {"01_Non Veg":"01_Chicken"}
expense_details.replace({"Catagory":replace_nonVeg},inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_16088\44519390.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expense_details.replace({"Catagory":replace_nonVeg},inplace=True)

In [22]:
expense_details

                   Expense Details  Amount   Catagory
Date
2023-01-01             HPGas big 1  1950.0     02_Gas
2023-01-01            Live singing  5000.0    03_Misc
2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary
2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary
2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary
...                            ...     ...        ...
2023-07-20          Ankit July adv  1000.0  04_Salary
2023-07-20    Yuvraj full sal June  6500.0  04_Salary
2023-07-21            French fries   380.0   01_Dairy
2023-07-21                  Corn 2   240.0   01_Dairy
2023-07-21    Pankaj full sal June  7800.0  04_Salary

[946 rows x 3 columns]

In [23]:
expense_details["Catagory"].value_counts()
#segregation by established category

Catagory
04_Salary           417
03_Petrol           118
02_Gas               92
03_Misc              84
03_Maintainance      35
01_Kirana            32
04_Samaj seva        29
03_Cash Return       28
04_ODC               24
01_Dairy             18
01_Vegetables        17
04_Salary OT         15
03_Room Rent         11
02_Electric bill      9
01_Chicken            6
02_Coal               6
01_Egg                3
01_Mutton             1
01_Fish               1
Name: count, dtype: int64

In [24]:
np.where(expense_details["Expense Details"].isnull())
#found null value

(array([353], dtype=int64),)

In [25]:
expense_details["Expense Details"].isnull().index[353]
#null value index

Timestamp('2023-03-10 00:00:00')

###### This index has the amount 30 and Category 03_Misc, it can be neglected but until further instruction noting will be done
But for now I will drop it to continue analysis

In [26]:
# Modify the original DataFrame 'df' by dropping rows containing null values
expense_details.dropna(inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_16088\1676923849.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expense_details.dropna(inplace=True)

In [27]:
expense_details

                   Expense Details  Amount   Catagory
Date
2023-01-01             HPGas big 1  1950.0     02_Gas
2023-01-01            Live singing  5000.0    03_Misc
2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary
2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary
2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary
...                            ...     ...        ...
2023-07-20          Ankit July adv  1000.0  04_Salary
2023-07-20    Yuvraj full sal June  6500.0  04_Salary
2023-07-21            French fries   380.0   01_Dairy
2023-07-21                  Corn 2   240.0   01_Dairy
2023-07-21    Pankaj full sal June  7800.0  04_Salary

[945 rows x 3 columns]

In [28]:
expense_details.to_excel("New-Expense-Details.xlsx")
#Created a seperate file for the updated expenses

In [29]:
update_expense_details = expense_details
#Reassigning value

In [30]:
update_expense_details.isnull().sum()
#So there are no missing values

Expense Details    0
Amount             0
Catagory           0
dtype: int64

<hr style="border: 2px solid black;">

# The Sub Categorisation Begins here...

<hr style="border: 2px solid black;">

In [31]:
pankaj_salary = update_expense_details[update_expense_details["Expense Details"].str.startswith('Pankaj')]

In [32]:
len(pankaj_salary)

9

In [33]:
pankaj_salary

                            Expense Details  Amount   Catagory
Date
2023-03-26          Pankaj chef (March adv)  1000.0  04_Salary
2023-04-03          Pankaj chef (March adv)  1000.0  04_Salary
2023-04-16  Pankaj chef (March full salary)  2000.0  04_Salary
2023-05-13    Pankaj chef April full salary  5000.0  04_Salary
2023-05-24             Pankaj chef May adv.   500.0  04_Salary
2023-05-28              Pankaj chef May adv  3500.0  04_Salary
2023-06-17    Pankaj chef (May full salary)  7000.0  04_Salary
2023-06-26                      Pankaj chef   500.0  04_Salary
2023-07-21             Pankaj full sal June  7800.0  04_Salary

In [34]:
pankaj_salary["Amount"].array

<PandasArray>
[1000.0, 1000.0, 2000.0, 5000.0, 500.0, 3500.0, 7000.0, 500.0, 7800.0]
Length: 9, dtype: float64

In [35]:
pankaj_salary["Amount"].array.sum()

28300.0

<hr style="border: 2px solid black;">

In [36]:
HP_gas = update_expense_details[update_expense_details["Expense Details"].str.startswith('HP')]

In [37]:
HP_gas

           Expense Details  Amount Catagory
Date
2023-01-01     HPGas big 1  1950.0   02_Gas
2023-01-05  HP Gas small 2  2300.0   02_Gas
2023-01-07  HP Gas small 1  1150.0   02_Gas
2023-01-08  HP Gas small 1  1150.0   02_Gas
2023-01-08    HP Gas big 1  1950.0   02_Gas
...                    ...     ...      ...
2023-05-22  HP Gas small 1  1200.0   02_Gas
2023-05-23  HP gas small 1  1200.0   02_Gas
2023-05-25  HP gas small 1  1200.0   02_Gas
2023-05-28    HP gas big 1  2060.0   02_Gas
2023-06-09  HP gas small 2  2400.0   02_Gas

[81 rows x 3 columns]

In [38]:
HP_gas["Amount"].array

<PandasArray>
[1950.0, 2300.0, 1150.0, 1150.0, 1950.0, 1150.0, 1150.0, 1150.0, 1150.0,
 1950.0, 2300.0, 2300.0, 1160.0, 1950.0, 1150.0, 1150.0, 1150.0, 1150.0,
 1150.0, 1150.0, 1950.0, 1150.0, 1150.0, 1150.0, 1150.0, 1950.0, 1150.0,
 3100.0, 1150.0, 1950.0, 1150.0, 1150.0, 1150.0, 1150.0, 1950.0, 1200.0,
 2300.0, 1200.0, 1200.0, 2300.0, 1200.0, 1200.0, 2400.0, 2300.0, 1200.0,
 1700.0, 2300.0, 8500.0, 2230.0, 1200.0, 1200.0, 2230.0, 2400.0, 2230.0,
 1200.0, 3430.0, 1200.0, 1200.0, 2230.0, 1200.0, 1200.0, 1200.0, 1200.0,
 2230.0, 1200.0, 2400.0, 2170.0, 1200.0, 1200.0, 1200.0, 1200.0, 2160.0,
 1200.0, 1200.0, 1200.0, 2060.0, 1200.0, 1200.0, 1200.0, 2060.0, 2400.0]
Length: 81, dtype: float64

In [39]:
HP_gas["Amount"].array.sum()

135290.0

In [40]:
len(HP_gas["Amount"].array)

81

<hr style="border: 2px solid black;">

In [41]:
Kirana =  update_expense_details[update_expense_details["Catagory"].str.startswith("01_Kirana")]

In [42]:
Kirana

                              Expense Details  Amount   Catagory
Date
2023-01-02                                Tea    50.0  01_Kirana
2023-01-04                       Wheel powder   150.0  01_Kirana
2023-01-08                         Corn flour   280.0  01_Kirana
2023-01-10                              Sugar    40.0  01_Kirana
2023-01-20                            Vinegar    30.0  01_Kirana
2023-01-21                        Gulab Jamun   200.0  01_Kirana
2023-01-26                 Chai patti (2 pkt)    50.0  01_Kirana
2023-01-28                   Agarbati (1 pkt)    50.0  01_Kirana
2023-02-08                            Noodles    50.0  01_Kirana
2023-02-17                         Sugar 1 kg    40.0  01_Kirana
2023-02-21                        Oil (3 pkt)   390.0  01_Kirana
2023-02-26                         Bush color   140.0  01_Kirana
2023-03-06                       Ajay kirana    400.0  01_Kirana
2023-03-09                          Oil 2 pkt   250.0  01_Kirana
2023-03-14                                Oil   500.0  01_Kirana
2023-03-16                           Oil 2pkt   270.0  01_Kirana
2023-03-23                          Sugar 1kg    45.0  01_Kirana
2023-03-24                                Tea    50.0  01_Kirana
2023-04-02                         Oil (5 kg)   700.0  01_Kirana
2023-04-04                           Oil 5 kg   630.0  01_Kirana
2023-04-09                       Noodles (2p)    80.0  01_Kirana
2023-04-16               Khada jeera (250 gm)   150.0  01_Kirana
2023-04-23                          Ajinomoto   110.0  01_Kirana
2023-05-17  Aata 2kg, maida 2 kg, powder 1 kg   190.0  01_Kirana
2023-05-18                  Wheel powder 1 kg    72.0  01_Kirana
2023-05-20                     staff rice 3kg    96.0  01_Kirana
2023-05-27                         Salt 1 pkt    28.0  01_Kirana
2023-06-10                         Besan 1 kg   100.0  01_Kirana
2023-06-17      Egg tray , tadka mirchi, tea    500.0  01_Kirana
2023-06-21                      Achaar bottle   150.0  01_Kirana
2023-06-28                             Besan    150.0  01_Kirana
2023-06-29                          Oil 3 pkt   330.0  01_Kirana

In [43]:
Oil = update_expense_details[update_expense_details["Expense Details"].str.startswith("Oil")]

In [44]:
Oil

           Expense Details  Amount   Catagory
Date
2023-02-21     Oil (3 pkt)   390.0  01_Kirana
2023-03-09       Oil 2 pkt   250.0  01_Kirana
2023-03-14             Oil   500.0  01_Kirana
2023-03-16        Oil 2pkt   270.0  01_Kirana
2023-04-02      Oil (5 kg)   700.0  01_Kirana
2023-04-04        Oil 5 kg   630.0  01_Kirana
2023-06-29       Oil 3 pkt   330.0  01_Kirana

In [45]:
Oil["Amount"].array.sum()

3070.0

<hr style="border: 2px solid black;">